test.signed.xml

<?xml version="1.0" encoding="utf-8" standalone="no"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns2:getStatoConsenso xmlns:ns2="http://statoConsenso.webservice.escape.com/">
         <arg0>
            <codiceAziendaErogatrice>9999</codiceAziendaErogatrice>
            <codiceFiscalePaziente>RMNDNL60P27H501B</codiceFiscalePaziente>
            <codiceRichiesta>9999</codiceRichiesta>
         </arg0>
      </ns2:getStatoConsenso>
   </S:Body>
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="xmldsig-2a58ca91-6d63-4247-8343-34b34f710d30">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
<ds:Reference Id="xmldsig-2a58ca91-6d63-4247-8343-34b34f710d30-ref0" URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
<ds:DigestValue>z6DGpM53Q9MEhdlOojlSt7iBzR488Cry2aCYxlI6Y8w=</ds:DigestValue>
</ds:Reference>
<ds:Reference Type="http://uri.etsi.org/01903#SignedProperties" URI="#xmldsig-2a58ca91-6d63-4247-8343-34b34f710d30-signedprops">
<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
<ds:DigestValue>qwMfs0CmIaU/a1fWVb9TVJK/nXbpnv5cucRKfNEF+aY=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue Id="xmldsig-2a58ca91-6d63-4247-8343-34b34f710d30-sigvalue">
evx3Ymm8SDiN/sPvvHrBHA5d2BOPLeJw8C1OuS54hyR1/T/i35yGk7Z0oHyvfFXaMaPVS4bz3hiM
hndZxOCcakprABMMif/4EvBq/bEhuhd8v7WfivV+XckDlaUcyZf8VJvP59Q5st7Iix7QA/naY89T
JpT88AESBYEW6zZgoDihpMLgWWSa1BIKRXkXSWGK9CtSeWIP8DfYl1HkfAZzhGJrV4+LyquCWSTj
VNnqmrHQuBuu7VAAR+dIhck6CseuSTmY4fbLlM1JufIaFmy+JbXXg0gMt+Syhw2tqeA6dH87UcX2
a9+82VOmOnVEvBo39IPdkNFbNpCdAW9JN7yTqA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>
MIIF7DCCBNSgAwIBAgIIAluOApqFoI4wDQYJKoZIhvcNAQELBQAwfTELMAkGA1UEBhMCSVQxJDAi
BgNVBAoMG05hbWlyaWFsIFMucC5BLi8wMjA0NjU3MDQyNjEgMB4GA1UECwwXQ2VydGlmaWNhdGlv
biBBdXRob3JpdHkxJjAkBgNVBAMMHU5hbWlyaWFsIENBIEZpcm1hIFF1YWxpZmljYXRhMB4XDTE5
MTAwMzE0MTMwMFoXDTIyMTAwMTIyMDAwMFowgYMxCzAJBgNVBAYTAklUMRAwDgYDVQQEDAdDSElS
SUNPMQwwCgYDVQQqDANVR08xHzAdBgNVBAUTFlRJTklULUNIUkdVTzcwUzE4RjgzOVgxFDASBgNV
BAMMC0NISVJJQ08gVUdPMR0wGwYDVQQuExRMT0NVMjAxOTEwMDM4MjQ4MjkzMDCCASIwDQYJKoZI
hvcNAQEBBQADggEPADCCAQoCggEBAI0WJim0eb8iucwFGDMkp9JqkXgaBlUDVMtf3dbHoJNxhCeM
uA4kIg2SsuC7tUW54D2HWPA96J7LWqY+yLvM8C+0pvIjB73BCqCtrzAIuHPv9TPbAlwovj/e94yK
zXF8xDfwVW4BikuXnQEUHgmHdrqGnwO/uFO92YAdJMmnNoNnswrR8knzbWl/SQpzopcggPxqwo+r
0LfNRrLpSqb0pBejVuZ8zmfuMkMQZBOjeQrQ5DfvQlyB9Iz2+oXiu//8XyF7V+nUEO3Y5MqI8VF5
+SsnH3CeqqhczVqxO3uGPtaXh2i5WmQRAhzTV5sI7ipDpLBS8hxTQpuD/LnOxcEBeJUCAwEAAaOC
AmcwggJjMIGcBggrBgEFBQcBAQSBjzCBjDBRBggrBgEFBQcwAoZFaHR0cHM6Ly9kb2NzLm5hbWly
aWFsdHNwLmNvbS9kb2N1bWVudHMvTmFtaXJpYWxDQUZpcm1hUXVhbGlmaWNhdGEuY3J0MDcGCCsG
AQUFBzABhitodHRwOi8vb2NzcC5uYW1pcmlhbHRzcC5jb20vb2NzcC9jZXJ0c3RhdHVzMB0GA1Ud
DgQWBBRvfJJGZzv4lI3DZNrsDeRsRDUMijAfBgNVHSMEGDAWgBRj/e3mjGJHSM/qCUFzdhHiZGJ7
EDCBzQYIKwYBBQUHAQMEgcAwgb0wCAYGBACORgEBMAsGBgQAjkYBAwIBFDAIBgYEAI5GAQQwEwYG
BACORgEGMAkGBwQAjkYBBgEwgYQGBgQAjkYBBTB6MDsWNWh0dHBzOi8vZG9jcy5uYW1pcmlhbHRz
cC5jb20vZG9jdW1lbnRzL1BEUy9QRFNfZW4ucGRmEwJlbjA7FjVodHRwczovL2RvY3MubmFtaXJp
YWx0c3AuY29tL2RvY3VtZW50cy9QRFMvUERTX2l0LnBkZhMCaXQwWgYDVR0gBFMwUTAJBgcEAIvs
QAECMDoGCysGAQQBgpprAQECMCswKQYIKwYBBQUHAgEWHWh0dHBzOi8vZG9jcy5uYW1pcmlhbHRz
cC5jb20vMAgGBgQAj3oBAjBGBgNVHR8EPzA9MDugOaA3hjVodHRwOi8vY3JsLm5hbWlyaWFsdHNw
LmNvbS9GaXJtYUNlcnRhUXVhbGlmaWNhdGExLmNybDAOBgNVHQ8BAf8EBAMCBkAwDQYJKoZIhvcN
AQELBQADggEBAKWv8YMsbvvJvb/VARovPbn1a15xX+AZg3QrLftjKfUJy6yCJEJ/rDWDN77lNORF
voreyO7PGhNMrxxeMydYsx7lYiecIETDGRi6eEWKuYy2fCGx5Pqh9FKzTwkoLHg0B2Z4Ordt2psZ
SKInq68qNW88scm73oYrUKPj37kgbYLy0gp6mvZ8FJnGh4bNkkEclgB33J/yURT45e0mihcZhwe4
aOJ8t1CDWrxjGEVbGEE/JUsZeB/8D/c+geulYo8yuDWaSc+gcNfhg06eBe0Oxtkt7ElM3c1w+Zy7
ZQO/jtM1KByw+mQtDMp4Y8zBmVOmenZcdSURS1A9qgt8CUVQdEE=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
<ds:Object><xades:QualifyingProperties xmlns:xades="http://uri.etsi.org/01903/v1.3.2#" xmlns:xades141="http://uri.etsi.org/01903/v1.4.1#" Target="#xmldsig-2a58ca91-6d63-4247-8343-34b34f710d30"><xades:SignedProperties Id="xmldsig-2a58ca91-6d63-4247-8343-34b34f710d30-signedprops"><xades:SignedSignatureProperties><xades:SigningTime>2020-10-21T11:02:12.945+02:00</xades:SigningTime><xades:SigningCertificate><xades:Cert><xades:CertDigest><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>cPz6j2W7FepkOwEXZP8356xmdVvmtl91+xKtNm30Ps0=</ds:DigestValue></xades:CertDigest><xades:IssuerSerial><ds:X509IssuerName>CN=Namirial CA Firma Qualificata,OU=Certification Authority,O=Namirial S.p.A./02046570426,C=IT</ds:X509IssuerName><ds:X509SerialNumber>169885552790053006</ds:X509SerialNumber></xades:IssuerSerial></xades:Cert></xades:SigningCertificate></xades:SignedSignatureProperties></xades:SignedProperties></xades:QualifyingProperties></ds:Object>
</ds:Signature></S:Envelope>